<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"40b3ac6a413cbf8895f8854ae2aa40d129f54ecb1b482df2eb46094b487b2e19","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1524 at https://github.com/cal-itp/data-infra/actions/runs/22374121500","plan_out_hash":"1061dd9bb34892f3f3d6b47fd2eed555f58cf8af36be1e29a225cc8c1fbc6db9","plan_hash":"c46385403b9c2dab44e1ad5283dff5ab3feda558b63008701d88e4936e78e292","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "KGpq4A==" -> (known after apply)
!~      detect_md5hash      = "egG+55F6qNaezNVndlvgLw==" -> "different hash"
!~      generation          = 1771964840727638 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "egG+55F6qNaezNVndlvgLw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/incremental_max_date.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "urecEQ==" -> (known after apply)
!~      detect_md5hash      = "nnPFGGCdP2fUbeK5dcm3/g==" -> "different hash"
!~      generation          = 1768335714431689 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/incremental_max_date.sql"
!~      md5hash             = "nnPFGGCdP2fUbeK5dcm3/g==" -> (known after apply)
        name                = "data/warehouse/macros/incremental_max_date.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/incremental_where.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "x05QtA==" -> (known after apply)
!~      detect_md5hash      = "Jux0bMT7k/jg+XRf4QJj/g==" -> "different hash"
!~      generation          = 1770942485429940 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/incremental_where.sql"
!~      md5hash             = "Jux0bMT7k/jg+XRf4QJj/g==" -> (known after apply)
        name                = "data/warehouse/macros/incremental_where.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "BQbewA==" -> (known after apply)
!~      detect_md5hash      = "kuW5mqpqttc0tyFNZ1EV9A==" -> "different hash"
!~      generation          = 1771964842085740 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "kuW5mqpqttc0tyFNZ1EV9A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1524](https://github.com/cal-itp/data-infra/actions/runs/22374121500)